etc/test/load-test-report-google_2022-01-14.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.google.com (be patient).....done


Server Software:        gws
Server Hostname:        www.google.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        www.google.com

Document Path:          /
Document Length:        14160 bytes

Concurrency Level:      1
Time taken for tests:   2.483 seconds
Complete requests:      10
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      150516 bytes
HTML transferred:       141746 bytes
Requests per second:    4.03 [#/sec] (mean)
Time per request:       248.292 [ms] (mean)
Time per request:       248.292 [ms] (mean, across all concurrent requests)
Transfer rate:          59.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       93   97   4.5     96     107
Processing:   118  151  75.0    125     361
Waiting:      114  147  75.5    120     358
Total:        211  248  78.3    222     468

Percentage of the requests served within a certain time (ms)
  50%    222
  66%    226
  75%    228
  80%    258
  90%    468
  95%    468
  98%    468
  99%    468
 100%    468 (longest request)